import Image from 'next/image';
import Link from "next/link";


export default function Home() {
  return (
  <div className="home">
    <div className="home_h">
      <h1>Travian World</h1>
      <h2>О нас</h2>
    </div>
    <div className="home_content">
      <div className="home_colomn">
        <div className="home_block">
          <h3>О нашем проекте</h3>
          <p>
            Привет. Мое имя Игорь, и я являюсь идеологом данной платформы. Я веду Ютуб канал, посвященный игре Травиан, и так же являюсь активным пользователем данной игры. Долгое время меня беспокоила одна важная проблема, с которой сталкиваются многие игроки. Для качественной игры в Травиан, необходимо иметь большое количество вспомогательных вкладок с различными гайдами, калькуляторами и Гугл таблицами. И так родилась идея создать проект Travian World. В данный момент мы собрали команду для разработки проекта и все вместе трудимся над разработкой. Проект будет развиваться, обрастать новыми гайдами и калькуляторами. И наша цель будет достигнута тогда, когда вам будет достаточно иметь всего одну вспомогательную вкладку, для комфортной игры.
          </p>
        </div>
        <div className="home_block">
          <h3>Поддержать проект</h3>
          <p>
            Не смотря на то, что у нашей команды очень много вдохновения, данный проект делается альтруистическими усилиями. Тем не менее, мы вынуждены нести некоторое количество расходов на разработку и поддержание платформы. Если у вас есть желание поддержать Travian World звонкой монеткой, вы можете выбрать один из способов , указанных ниже
          </p>
          <h4>Спасибо за поддержку</h4>
          <div className="footer_link">
            <Link className="footer_linkIcon" href="/Support">
                <svg width="13" height="16" viewBox="0 0 13 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M2.42572 9.00754L4.2108 2.82547H6.95412L6.40108 4.74197C6.3956 4.75292 6.39013 4.76387 6.38465 4.77482L4.92811 9.83437H6.28609C5.71662 11.2526 5.27308 12.3641 4.95549 13.1691C2.44762 13.1417 1.74673 11.3457 2.36001 9.22109M4.96644 13.1745L8.27377 8.41616H6.87199L8.09307 5.3662C10.1848 5.58522 11.1704 7.23341 10.59 9.22656C9.97124 11.3676 7.46336 13.1745 5.0212 13.1745C4.9993 13.1745 4.98287 13.1745 4.96644 13.1745Z" fill="url(#paint0_linear_472_16641)"/>
                <defs>
                <linearGradient id="paint0_linear_472_16641" x1="7.94401" y1="4.16965" x2="4.41268" y2="16.2124" gradientUnits="userSpaceOnUse">
                <stop stopColor="#EF7829"/>
                <stop offset="0.0518954" stopColor="#F07529"/>
                <stop offset="0.3551" stopColor="#F0672B"/>
                <stop offset="0.6673" stopColor="#F15E2C"/>
                <stop offset="1" stopColor="#F15A2C"/>
                </linearGradient>
                </defs>
                </svg>
            </Link>
            <Link className="footer_linkIcon" href="/Support">
                <svg width="14" height="16" viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_472_16644)">
                <path d="M6.97172 9.31764H5.88766C5.82456 9.31793 5.76428 9.2942 5.72184 9.25235C5.67939 9.21051 5.65875 9.15449 5.66506 9.09822L5.76078 8.12078C5.77008 8.01688 5.86707 7.93692 5.98338 7.93726H7.06744C7.13054 7.93697 7.19082 7.96071 7.23327 8.00255C7.27572 8.04439 7.29635 8.10042 7.29004 8.15668L7.19432 9.13412C7.18502 9.23802 7.08803 9.31798 6.97172 9.31764ZM7.14547 7.40392H6.04125C5.91928 7.40392 5.82041 7.30872 5.82041 7.19129L6.12076 3.88908C6.13423 3.78171 6.22927 3.70119 6.3416 3.70197H7.44582C7.56779 3.70197 7.66667 3.79717 7.66667 3.9146L7.35748 7.21893C7.34346 7.32229 7.25369 7.40063 7.14547 7.40392ZM13.6382 3.55311C13.7557 3.68954 13.8131 3.86718 13.7975 4.04609L13.3659 8.9519C13.352 9.11237 13.2804 9.2625 13.1642 9.37475L9.6348 12.7816C9.50881 12.9027 9.34023 12.9703 9.16489 12.9699H5.40758L2.10002 16L2.35616 12.9679H0.674142C0.485228 12.9681 0.304935 12.8894 0.177229 12.7511C0.0495232 12.6127 -0.0138565 12.4275 0.00254627 12.2405L1.0291 0.601204C1.06432 0.259142 1.35465 -0.000754985 1.7007 1.64782e-06H10.2661C10.4631 -5.49015e-05 10.6503 0.0856254 10.7783 0.234471L13.6382 3.55311ZM11.0224 8.01603L11.2966 4.98798C11.3073 4.80845 11.2448 4.63222 11.1232 4.499L9.50976 2.6473C9.3819 2.501 9.19652 2.41694 9.00153 2.41684H3.91918C3.57314 2.41608 3.28281 2.67598 3.24758 3.01804L2.64254 9.83166C2.62861 10.0181 2.69284 10.2019 2.82002 10.3397C2.9472 10.4775 3.12602 10.5569 3.31414 10.5591H8.31178C8.48516 10.5595 8.65203 10.4935 8.77766 10.3747L10.8207 8.44088C10.9374 8.32813 11.009 8.17721 11.0224 8.01603Z" fill="url(#paint0_linear_472_16644)"/>
                </g>
                <defs>
                <linearGradient id="paint0_linear_472_16644" x1="1203.3" y1="3.64072e-06" x2="-25.9491" y2="1425.21" gradientUnits="userSpaceOnUse">
                <stop stopColor="#F59C07"/>
                <stop offset="1" stopColor="#F57507"/>
                </linearGradient>
                <clipPath id="clip0_472_16644">
                <rect width="13.8" height="16" fill="white"/>
                </clipPath>
                </defs>
                </svg>
            </Link>
            <Link className="footer_linkIcon" href="/Support">
                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_472_16651)">
                <path d="M2.82097 0.28125V15.6781H0V0.28125H2.82097ZM10.2286 0.28125C13.416 0.28125 16 2.86521 16 6.05268C16 9.24015 13.416 11.8241 10.2286 11.8241C7.0411 11.8241 4.45714 9.24015 4.45714 6.05268C4.45714 2.86521 7.0411 0.28125 10.2286 0.28125Z" fill="#FF424D"/>
                </g>
                <defs>
                <clipPath id="clip0_472_16651">
                <rect width="16" height="16" fill="white"/>
                </clipPath>
                </defs>
                </svg>
            </Link>
          </div>
        </div>
        <div className="home_block">
          <h3>Предложения и замечания</h3>
          <p>
            Без вас, мы не сможем достигнуть желаемого качества. Каждый пользователь платформы может написать свою идею, или сообщить об ошибке в нашем Дискорде
          </p>
          <div className="home_link">
              <Link className="footer_linkIcon" href="/Community">
                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clipPath="url(#clip0_472_16662)">
                <path d="M13.5447 2.91319C12.5074 2.43704 11.4126 2.09749 10.2879 1.90306C10.2777 1.90115 10.2672 1.90252 10.2578 1.90696C10.2484 1.9114 10.2406 1.91869 10.2356 1.92779C10.0949 2.17799 9.93914 2.50433 9.83007 2.76079C8.60027 2.57666 7.37674 2.57666 6.1722 2.76079C6.06314 2.49859 5.90167 2.17799 5.7604 1.92779C5.75517 1.9189 5.74738 1.91178 5.73804 1.90738C5.72871 1.90298 5.71826 1.9015 5.70807 1.90313C4.58326 2.0971 3.48846 2.43662 2.45127 2.91313C2.4424 2.91692 2.43492 2.92337 2.42987 2.93159C0.355603 6.03053 -0.212664 9.05326 0.066136 12.0385C0.0669243 12.0458 0.0691714 12.0529 0.0727443 12.0593C0.0763171 12.0658 0.081143 12.0714 0.086936 12.0759C1.45547 13.081 2.78114 13.6911 4.0822 14.0955C4.09232 14.0985 4.10312 14.0984 4.11315 14.0951C4.12318 14.0918 4.13197 14.0855 4.13834 14.0771C4.44607 13.6569 4.7204 13.2137 4.95567 12.7477C4.9589 12.7413 4.96075 12.7343 4.96109 12.7271C4.96142 12.72 4.96024 12.7129 4.95762 12.7062C4.955 12.6995 4.951 12.6935 4.94589 12.6885C4.94077 12.6835 4.93465 12.6797 4.92794 12.6772C4.49274 12.5121 4.0784 12.3109 3.6798 12.0823C3.67253 12.0781 3.66643 12.0721 3.66202 12.0649C3.65762 12.0577 3.65506 12.0495 3.65456 12.0411C3.65405 12.0327 3.65563 12.0243 3.65915 12.0166C3.66267 12.009 3.66802 12.0023 3.67474 11.9972C3.7586 11.9343 3.84254 11.869 3.9226 11.8029C3.92972 11.7971 3.93833 11.7933 3.94747 11.7921C3.95661 11.7908 3.96592 11.7922 3.97434 11.7959C6.59287 12.9915 9.42767 12.9915 12.0153 11.7959C12.0237 11.7919 12.0331 11.7904 12.0424 11.7915C12.0516 11.7926 12.0604 11.7964 12.0676 11.8023C12.1477 11.8683 12.2316 11.9343 12.3161 11.9972C12.3229 12.0022 12.3282 12.0089 12.3318 12.0165C12.3354 12.0241 12.337 12.0325 12.3366 12.0409C12.3361 12.0493 12.3337 12.0575 12.3293 12.0647C12.325 12.0719 12.3189 12.0779 12.3117 12.0823C11.913 12.3152 11.4953 12.514 11.0631 12.6765C11.0564 12.6791 11.0503 12.683 11.0452 12.6881C11.0401 12.6932 11.0362 12.6993 11.0336 12.706C11.031 12.7127 11.0299 12.7199 11.0303 12.7271C11.0307 12.7343 11.0326 12.7413 11.0359 12.7477C11.2762 13.213 11.5505 13.6562 11.8526 14.0765C11.8588 14.0851 11.8675 14.0916 11.8776 14.0951C11.8877 14.0985 11.8986 14.0986 11.9087 14.0955C13.2161 13.6911 14.5417 13.0809 15.9103 12.0759C15.9162 12.0716 15.9211 12.0661 15.9247 12.0598C15.9283 12.0534 15.9305 12.0464 15.9311 12.0391C16.2647 8.58779 15.3723 5.58986 13.5655 2.93219C13.561 2.92356 13.5537 2.91686 13.5447 2.91319ZM5.34667 10.2208C4.55834 10.2208 3.90874 9.49699 3.90874 8.60813C3.90874 7.71933 4.54574 6.99553 5.34674 6.99553C6.15394 6.99553 6.7972 7.72566 6.7846 8.60819C6.7846 9.49699 6.1476 10.2208 5.34667 10.2208ZM10.6632 10.2208C9.87487 10.2208 9.22527 9.49699 9.22527 8.60813C9.22527 7.71933 9.8622 6.99553 10.6632 6.99553C11.4704 6.99553 12.1137 7.72566 12.1011 8.60819C12.1011 9.49699 11.4704 10.2208 10.6632 10.2208Z" fill="black" fillOpacity="0.6"/>
                </g>
                <defs>
                <clipPath id="clip0_472_16662">
                <rect width="16" height="16" fill="white"/>
                </clipPath>
                </defs>
                </svg>
              </Link>
          </div>
          </div>
          </div>
          <div className="home_colomn2">
            <Image className='homeGaul'
              src="/img/homeGaul.png"
              width="200" 
              height="210" 
              alt="Guidespage" />
            <link rel="icon" href="/img/homeGaul.png" sizes="any" />
            <h3>Наша команда</h3>
            <div className="home_team">
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
              <p>Вася - разраб 1</p>
            </div>
          </div>
        </div>
      </div>
  )
}
